package com.example.deimos.visitsongkhla;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.util.Log;
import android.view.Menu;
import android.view.MenuItem;

import com.ittianyu.bottomnavigationviewex.BottomNavigationViewEx;

import java.util.ArrayList;

public class Home extends AppCompatActivity {
    private static final int ACTIVITY_NUM=0;
    private static final String TAG = "Home";
    RecyclerView recyclerView;
    private ArrayList<String>mNames = new ArrayList<>();
    private ArrayList<String>mImageUrls = new ArrayList<>();
    private ArrayList<String>mDes = new ArrayList<>();
    private ArrayList<String>mTopic= new ArrayList<>();

    private ArrayList<String>mNames2 = new ArrayList<>();
    private ArrayList<String>mImageUrls2 = new ArrayList<>();
    private ArrayList<String>mDes2 = new ArrayList<>();
    private ArrayList<String>mTopic2= new ArrayList<>();

    private ArrayList<String>mNames3 = new ArrayList<>();
    private ArrayList<String>mImageUrls3 = new ArrayList<>();
    private ArrayList<String>mDes3 = new ArrayList<>();
    private ArrayList<String>mTopic3= new ArrayList<>();


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.home);
        setNavi();
        getImages();
        getImages2();
        getImages3();
    }
    public void setNavi(){
        BottomNavigationViewEx bottomNavigationViewEx = (BottomNavigationViewEx) findViewById(R.id.bottomNavViewBar);
        BottomNavigationViewHelper.setupBottomNavigationView(bottomNavigationViewEx);
        BottomNavigationViewHelper.enableNavigation(Home.this,bottomNavigationViewEx);
        Menu menu =bottomNavigationViewEx.getMenu();
        MenuItem menuItem=menu.getItem(ACTIVITY_NUM);
        menuItem.setChecked(true);
    }
    private void getImages(){
        mImageUrls.add("https://firebasestorage.googleapis.com/v0/b/visitsongkhla.appspot.com/o/Home%2FPlaces%2Fs1.JPG?alt=media&token=e3bdab07-a887-4008-975c-6224d0d3985e");
        mNames.add("สวนประวัติศาสตร์");
        mDes.add("  บนเนื้อที่ 150 ไร่ ภายในสวนประวัติศาสตร์พลเอก เปรม ติณสูลานนท์ แห่งนี้ จุความเพลิดเพลินที่น่าเรียนรู้ไว้มากมาย โดยมีการแบ่งพื้นที่ได้อย่างเป็นสัดส่วนที่เปิดโอกาสให้นักท่องเที่ยวได้เลือกชมตามความสนใจเฉพาะตัว ได้แก่\n" +
                "          • บริเวณที่ 1 คือหอประวัติ พลเอก เปรม ติณสูลานนท์ เพื่อเชิดชูเกียรติคุณความดีของ ฯพณฯ พลเอก เปรม ติณสูลานนท์ ประธานองคมนตรีและรัฐบุรุษ\n" +
                "          • บริเวณที่ 2 ประกอบด้วยสวนสาธารณะ ประติมากรรมกลางแจ้ง สวนพฤกษศาสตร์ สวนตาลโตนด แหล่งน้ำกลางสวน เวทีเปิดอัฒจันทร์ธรรมชาติ ลานวัฒนธรรมกลางแจ้ง ศูนย์จำหน่ายเครื่องดื่ม อาคารบริการท่าเทียบเรือ และศูนย์บริการท่องเที่ยวทางน้ำ\n" +
                "          • บริเวณที่ 3 ประกอบด้วยศูนย์บริการการเรียนรู้ระบบนิเวศป่าชายเลน ที่มีสะพานทางเดินศึกษาธรรมชาติชีวภาพป่าชายเลน (Walk way) ความยาว 800 เมตร มีศาลานิทรรศการ 4 ศาลา เพื่อศึกษาหาความรู้เกี่ยวกับป่าชายเลน มีลานพักแรม (Camping) สำหรับนักเรียน นักศึกษา และบุคคลทั่วไป ตลอดจนศูนย์ฝึกอบรม (ศูนย์ส่งเสริมอุตสาหกรรม ภาค 11) อาคารบ้านพักพนักงานและเรือนเพาะชำ \n");

        mImageUrls.add("https://firebasestorage.googleapis.com/v0/b/visitsongkhla.appspot.com/o/Home%2FPlaces%2Ft2.jpg?alt=media&token=48250ec1-6746-4533-8671-32ceb6b53a9b");
        mNames.add("เขาตังกวน");
        mDes.add("  ภูเขาลูกเล็ก ๆ แต่เป็นสถานที่ท่องเที่ยวที่สำคัญแห่งหนึ่งในอ.เมืองฯ โดยเขาตังกวนนั้นเป็นเนินเขาสูงจากระดับทะเลปานกลางประมาณ 2,000 ฟุต จากยอดเขาตังกวนนี้มีลานชมวิวเขาตังกวนที่สามารถมองเห็นทิวทัศน์ของเมืองสงขลาได้โดยรอบ กลายเป็นจุดชมวิวยอดนิยมที่สุดสำหรับนักท่องเที่ยวเมื่อเดินทางมาเยือนสงขลา นอกจากนี้ บนยอดเขาตังกวนเป็นที่ประดิษฐานเจดีย์พระธาตุคู่เมืองสงขลา ซึ่งสร้างในสมัยอาณาจักรนครศรีธรรมราช เป็นศิลปะสมัยทวารวดี โดยพระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัว รัชกาลที่ 4 ได้พระราชทานเงินหลวง ให้เป็นทุนในการบูรณะปฏิสังขรณ์ และในเดือนธันวาคม พ.ศ. 2539 พระบาทสมเด็จพระเจ้าอยู่หัวรัชกาลปัจจุบัน ได้ทรงพระราชทานพระบรมสารีริกธาตุมาบรรจุในองค์พระเจดีย์ และในเดือนตุลาคมของทุกปี จะมีงานพิธีห่มผ้าองค์พระเจดีย์ และประเพณีตักบาตรเทโว และลากพระของสงขลา");

        mImageUrls.add("https://firebasestorage.googleapis.com/v0/b/visitsongkhla.appspot.com/o/Home%2FPlaces%2Fs1.jpg?alt=media&token=ed892cfa-c62e-4e51-80c8-3f6ffadbe5cd");
        mNames.add("แหลมสมิหลา");
        mDes.add("  ถ้ามาถึงสงขลาแล้วไม่ได้เยือนหาดสมิหลาย่อมถือว่ามาไม่ถึง เพราะที่นี่คือไอคอนของเมืองสงขลาที่ทุกคนต้องมาแวะถ่ายภาพไว้เป็นที่ระลึก หาดสมิหลาเป็นชายหาดที่มีโขดหินขนาดย่อมยื่นลงทะเล ทรายขาวละเอียดมากที่เรียกว่า \"ทรายแก้ว\" ร่มรื่นด้วยป่าสน และจากหาดสมิหลายังสามารถมองเห็นทิวทัศน์อันงดงามของเกาะหนูเกาะแมว จนมีคำกล่าวว่าใครมาเยือนสงขลาแล้วไม่มาเยือนสมิหลาก็เหมือนมาไม่ถึงสงขลา อีกทั้งบริเวณหาดยังมีสัญลักษณ์ที่มีชื่อเสียง นั่นก็คือ รูปปั้นนางเงือกทอง ที่ทุกคนต้องแวะมาถ่ายภาพเก็บไว้ บรรยากาศโดยรอบของชายหาดเต็มไปด้วยความเงียบสงบ มีร้านอาหาร รีสอร์ต และร้านขายของที่ระลึกมากมาย รวมทั้งมีกิจกรรมทางน้ำเติมความสนุกให้นักท่องเที่ยว เช่น บานาน่าโบ๊ต เจ็ตสกี แล่นเรือใบ และชายหาดแห่งนี้ยังสามารถลงเล่นน้ำทะเลได้เนื่องจากเป็นชายหาดที่ไม่ลาดชัน และมียามรักษาการณ์จากเทศบาลเมืองสงขลาคอยดูแลความปลอดภัยตลอดทั้งวัน");

        mImageUrls.add("https://firebasestorage.googleapis.com/v0/b/visitsongkhla.appspot.com/o/Home%2FPlaces%2Fu1.jpg?alt=media&token=8eefaf85-9231-434e-844f-b57785edfbe0");
        mNames.add("ย่านเมืองเก่าสงขลา");
        mDes.add("  ย่านเก่าที่จะพาเราย้อนรอยไปสู่ความรุ่งเรืองในอดีตของสงขลาที่เปี่ยมด้วยบรรยากาศของวันวานสุดคลาสสิก และน่าค้นหา โดยครอบคลุมถนนสายสำคัญ 3 สาย ได้แก่ ถนนนครนอก ถนนนครใน และถนนนางงาม ที่เคยเฟื่องฟูมากในยุคหนึ่ง และถนนเหล่านี้คือจุดเริ่มต้นของการนั่งไทม์แมชชีนย้อนกลับไปสู่อดีตที่น่าหลงใหล ณ มุมหนึ่งของสงขลา\n" +
                "เดินตามรอยอดีต\n" +
                "          กล่าวกันว่า เมื่ออดีตราว 200 ปีก่อน ตัวเมืองสงขลาตั้งอยู่ทางฝั่งตะวันตกของทะเลสาบเรียกว่า \"เมืองสงขลาฝั่งแหลมสน\" จนกระทั่ง พ.ศ. 2385 จึงขยายมาทางฝั่งทิศตะวันออกบริเวณตำบลบ่อยาง เรียกกันว่า \"เมืองสงขลาฝั่งบ่อยาง\" ซึ่งเริ่มแรกมีถนนสองสายคือถนนนครนอก อันเป็นถนนเส้นนอกที่ติดกับทะเลสาบ และถนนนครในเป็นถนนเส้นในเมือง ต่อมามีการตัดถนนสายที่สามเรียกว่าถนนเก้าห้อง หรือย่านเก้าห้อง เพื่องานสมโภชเสาหลักเมืองต่อมาก็เรียกกันว่าถนนนางงามนั่นเอง การเดินชมย่านเก่า หากค่อย ๆ ลัดเลาะไปตามถนนทั้ง 3 สายนี้ คุณจะพบความคลาสสิกจากห้องแถวไม้แบบจีน ตึกเก่าสไตล์ชิโนโปรตุกีส ศาลเจ้าพ่อกวนอู โรงแรมนางงาม อันเป็นโรงแรมไม้เก่าแก่ประดับลายฉลุไม้วิจิตรบรรจง รวมทั้งยังมีตึกแถวแบบจีนโบราณของชาวจีนฮกเกี้ยนปะปนอยู่ด้วยกันทั้งสองฟากถนน อาคารหลายหลังมีการปรับปรุงทาสีใหม่แต่ก็ยังคงมีเอกลักษณ์น่าสนใจดุจเดิม\n");


        mImageUrls.add("https://firebasestorage.googleapis.com/v0/b/visitsongkhla.appspot.com/o/Home%2FPlaces%2Fp2.png?alt=media&token=26a9dd3c-6712-4520-a566-b9e9444a6e91");
        mNames.add("กำแพงเมืองเก่าสงขลา");
        mDes.add("  กำแพงเมืองสงขลาถูกสร้างขึ้นเมื่อปี พ.ศ.2379 ตรงกับสมัยรัชกาลที่ 3 โดยพระองค์โปรดเกล้าให้พระยาวิเชียรคีรี (เถี้ยนเส้ง) เจ้าเมืองสงขลา ณ ขณะนั้น ทำการย้ายเมืองจากแหลมสนมายังบ่อยาง กำแพงแห่งนี้สร้างเสร็จในปี พ.ศ.2385 (6ปี) การที่สร้างกำแพงล่าช้ามาจากสถานการณ์ที่หัวเมืองมลายูก่อกบฏ ในปี พ.ศ.2381 โดยกบฏมลายูยกทัพมาเผาเมืองจะนะ และเลยเข้ามาตีเมืองสงขลากำแพงเมืองสงขลาตั้งอยู่ห่างจากน้ำราว 40 เมตร กำแพงเมืองจากทิศตะวันออกถึงทิศตะันตกยาว 1,200 เมตร ด้านทิศเหนือถึงทิศใต้ยาว 1,000 เมตร  มีป้อมทั้งหมด 8 ป้อม มีประตูเมืองอยู่ 10 ประตู โดยประตูเมืองมีลักษณะเป็นซุ้มใหญ่ กว้าง 3 เมตร สูง 6 เมตร ซุ้มเป็นหลังคาแบบจีน โดยชื่อประตูเมืองสงขลาปรากฏหลักฐานในเอกสารโบราณ ได้แก่ 1.ประตูพุทธรักษา 2.ประตูสุรามฤทธิ์ 3.ประตูศักดิ์สิทธิ์พิทักษ์ 4.ประตูอัศนีวุธ 5.ประตูชัยยุทธชำนะ 6.ประตูบูรภาภิบาล 7.ประตูสนานสงคราม 8.ประตูพยัคฆนามเรืองฤทธิ์ 9.ประตูจัณทิพิทักษ์ 10.ประตูมรคาพิทักษ์ หลังจากเวลาล่วงเลยผ่านไป กำแพงแห่งนี้ก็ทรุดโทรมและเสื่อมสภาพตามกาลเวลา แต่กำแพงเมืองสงขลาก็ได้มีการซ่อมแซมและบูรณะมาโดยตลอด แต่เมื่อครั้งพระยายมราช (ปั้น สุขุม) เป็นพระวิจิตรวรสาสน์ ข้าหลวงพิเศษตรวจราชการเมืองสงขลา และเป็นพระยาสุขุมนัยวินิต สมุหเทศาภิบาลมณฑลนครศรีธรรมราช ในช่วงระหว่างปี พ.ศ.2437 - 2448 ได้มีคำสั่งให้รื้อกำแพงเมืองสงขลา เพื่อนำอิฐจากกำแพงมาใช้สร้างและปรับปรุงถนน \n" +
                "ต่อมามีการค้นพบหลักฐานทางโบราณคดีที่สำคัญ ได้แก่ แผ่นศิลาจารึกเป็นลายเส้นและตัวเลขฝังอยู่ใต้ป้อม สันนิษฐานว่าน่าจะเป็น \"ยันต์ 4\" ใช้สำหรับไล่ภูตผีปีศาจ และทำลายวัตถุอาถรรพ์เวทมนต์ดำ และในปี พ.ศ.2554 เกิดพายุฝนที่รุนแรง ส่งผลให้กำแพงเมืองสงขลาพังทลายลง และได้รับการบูรณะให้กลับมาสภาพเดิม โดยกรมศิลปากร\n");

        initRecyclerView();
    }
    private void initRecyclerView(){
        LinearLayoutManager layoutManager = new LinearLayoutManager(this, LinearLayoutManager.HORIZONTAL, false);
        RecyclerView recyclerView = findViewById(R.id.recyclerView);
        recyclerView.setLayoutManager(layoutManager);
        RecyclerViewAdapter adapter = new RecyclerViewAdapter(this,mNames, mImageUrls,mDes);
        recyclerView.setAdapter(adapter);
    }
    private void getImages2(){
        mImageUrls2.add("https://firebasestorage.googleapis.com/v0/b/projectfi-635a2.appspot.com/o/Theme%2F%E0%B8%AD%E0%B8%B8%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%99%E0%B9%81%E0%B8%AB%E0%B9%88%E0%B8%87%E0%B8%8A%E0%B8%B2%E0%B8%95%E0%B8%B4%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%95%E0%B8%81%E0%B8%97%E0%B8%A3%E0%B8%B2%E0%B8%A2%E0%B8%82%E0%B8%B2%E0%B8%A7-5.jpg?alt=media&token=24669e98-ee6e-4ba1-bcba-16d678160db6");
        mNames2.add("อุทยานแห่งชาติน้ำตกทรายขาว");
        mDes2.add("     เป็นน้ำตกที่ตกมาจากหน้าผาสูงประมาณ 30 เมตร สองข้างลำธารมีต้นไม้ขึ้นปกคลุมตลอด ให้ความร่มรื่นและสวยงามเป็นอย่างยิ่ง เป็นสถานที่พักผ่อนหย่อนใจของชุมชนและนักท่องเที่ยว โดยเฉพาะช่วงสุดสัปดาห์ ที่นี่จะเต็มไปด้วยผู้คนจากพื้นที่ต่างๆ นั่งล้อมวงรับประทานอาหารและลงเล่นน้ำร่วมกันอย่างมีความสุข");


        mImageUrls2.add("https://firebasestorage.googleapis.com/v0/b/projectfi-635a2.appspot.com/o/Theme%2F%E0%B8%8A%E0%B8%B8%E0%B8%A1%E0%B8%8A%E0%B8%99%E0%B8%9A%E0%B8%B2%E0%B8%87%E0%B8%9B%E0%B8%B9-1.JPG?alt=media&token=63d96196-d993-43d9-8723-153692ccbf2f");
        mNames2.add("ชุมชนบางปู");
        mDes2.add("     “บางปู” ตำบลเล็กๆ ริมอ่าวปัตตานี ในพื้นที่อำเภอยะหริ่ง จังหวัดปัตตานี รายล้อมไปด้วยธรรมชาติที่สวยงาม และความอุดมสมบูรณ์ของป่าชายเลน ซึ่งถือเป็นแหล่งทำมาหากินสำคัญของชาวประมงพื้นบ้านในพื้นที่แห่งนี้ นอกจากนี้ยังมีนกน้ำอีกนับหมื่นแสนตัว ทางชุมชนจึงได้จัดให้มีกิจกรรมท่องเที่ยวในพื้นที่ โดยจัดตั้งเป็น ชุมชนท่องเที่ยวบางปู บ้านบาลาดูวอ ต.บางปู อ.ยะหริ่ง จ.ปัตตานี โดยมีกิจกรรมให้เลือกมากมาย ทั้งล่องเรือชมความสมบูรณ์ของป่าชายเลน ชมอุโมงค์ป่าโกงกาง เพลิดเพลินกับวิถีชาวเล ดูฝูงนกน้อยบินกลับเข้ารัง เฝ้ารอแสงสุดท้ายยามพระอาทิตย์อัสดง…และไฮไลต์สำคัญอีกอย่างหนึ่งก็คือ การล่องเรือชมหิ่งห้อยยามค่ำคืน ซึ่งจะเปล่งแสงเล่นเวฟกันให้ได้เห็นกันอย่างสวยงาม\n" +
                "ความงดงามทางสายตาที่ยิ่งดูยิ่งมีเสน่ห์ บวกกับความมีน้ำใจของคนในชุมชนที่มีวิถีชีวิตที่เรียบง่ายด้วยแล้ว ทำให้ “บางปู” ยังคงเป็นสถานที่ที่ยังคงมีเสน่ห์อยู่เสมอ");


        mImageUrls2.add("https://firebasestorage.googleapis.com/v0/b/projectfi-635a2.appspot.com/o/Theme%2F%E0%B8%9E%E0%B8%A5%E0%B8%B1%E0%B8%9A%E0%B8%9E%E0%B8%A5%E0%B8%B2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%97%E0%B8%B1%E0%B8%9A%E0%B8%A3%E0%B8%B1%E0%B8%8A%E0%B8%81%E0%B8%B2%E0%B8%A5%E0%B8%97%E0%B8%B5%E0%B9%88%207-3.jpg?alt=media&token=02150d9b-9f78-4815-9034-58f129e88c84");
        mNames2.add("พลับพลาที่ประทับ");
        mDes2.add("     พลับพลาที่ประทับของรัชกาลที่ 7 คณะดาราศาสตร์ชาวอังกฤษและเยอรมัน คำนวณว่า พื้นที่จังหวัดปัตตานีสามารถมองเห็นสุริยุปราคาได้ชัดเจนกว่าที่จังหวัดอื่นๆ จึงกราบบังคมทูลเชิญรัชกาลที่ 7 เสด็จพระราชดำเนินทอดพระเนตร นักดาราศาสตร์ชาวอังกฤษเตรียมการติดตั้งกล้องและอุปกรณ์ บริเวณสนามหญ้าใกล้ศาลารัฐบาลมณฑลปัตตานี นักดาราศาสตร์ชาวเยอรมันเตรียมการติดตั้งกล้องและอุปกรณ์บนภูเขาหลังที่ว่าการอำเภอโคกโพธิ์ โดยมณฑลปัตตานีได้สร้างพลับพลาไว้เพื่อเป็นที่ปรับทับของรัชกาลที่ 7 ทั้งที่อำเภอโคกโพธิ์และอำเภอเมืองปัตตานี และพระองค์ได้เสด็จทอดพระเนตรสุริยุปราคาทั้งสองแห่ง เมื่อวันที่ 9 พฤศจิกายน พ.ศ. 2472 แต่อำเภอโคกโพธิ์วันนั้นท้องฟ้ามืดครึ้ม ไม่สามารถมองเห็นสุริยุปราคาได้ พระองค์จึงได้เสด็จมาทอดพระเนตรที่เมืองปัตตานี\n");


        mImageUrls2.add("https://firebasestorage.googleapis.com/v0/b/projectfi-635a2.appspot.com/o/Theme%2F%E0%B8%A7%E0%B8%B1%E0%B8%87%E0%B8%9E%E0%B8%B4%E0%B8%9E%E0%B8%B4%E0%B8%98%E0%B8%A0%E0%B8%B1%E0%B8%81%E0%B8%94%E0%B8%B5-1.jpg?alt=media&token=c4bbd810-69e7-43e4-971a-31557c1b5456");
        mNames2.add("วังพิพิธภักดี");
        mDes2.add("ตั้งอยู่ตรงข้ามกับวังสายบุรี สืบเนื่องจากพระพิพิธภักดี ได้มาหลงรักหลานสาวพระยาสุริยสุนทรบวรภักดีบุตรชายของเจ้าเมืองยะหริ่ง ต่อมาเมื่อพิพิธภักดีได้แต่งงานกับหลานสาวพระยาสุริยสุนทรบวรภักดี จึงได้สร้างวังพิพิธภักดีเป็นเรือนหออยู่ใกล้ๆกับวังสายบุรีนั่นเอง วังพิพิธภักดีเป็นอาคารไม้ 2 ชั้น ช่างท้องถิ่นเป็นผู้สร้างโดยนำศิลปะแบบตะวันตกและศิลปะของท้องถิ่นมาผสมผสานกันคือ มีหน้ามุขแบบตะวันตก ลูกกรงบันไดเป็นหลายปูนปั้นรูปดอกไม ");


        mImageUrls2.add("https://firebasestorage.googleapis.com/v0/b/projectfi-635a2.appspot.com/o/Theme%2F%E0%B8%AB%E0%B8%A1%E0%B8%B9%E0%B9%88%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%99%E0%B8%97%E0%B8%B3%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B8%AD%E0%B8%81%E0%B8%AD%E0%B9%81%E0%B8%A5%E0%B8%B0-3.jpg?alt=media&token=2c01ee85-e30f-4804-8a72-57ca8361867b");
        mNames2.add("หมู่บ้านทำเรือกอและ");
        mDes2.add("     บ้านปะเสยะวอ อำเภอปะนาเระ เป็นหมู่บ้านที่มีชื่อเสียงในการต่อเรือประมงของชาวปัตตานี และนราธิวาสที่มีลักษณะเป็นเรือหัวแหลมท้ายแหลม ระบายสีสันงดงาม เรือกอและมีทั้งขนาดใหญ่ที่เป็นเรือประมงจริงๆ และขนาดเล็กที่จำลองขึ้นเพื่อเป็นของที่ระลึก ฝีมือการต่อเรือกอและ ของที่นี่ได้รับการยอมรับว่าประณีตงดงามด้วยลวดลายที่ผสมกลมกลืนระหว่างศิลปะไทยและมุสลิม ในระยะแรกเลียนแบบเทคนิคการตกแต่งเรือพระราชพิธี คือ การแกะสลัก ซึ่งต้องใช้ฝีมือและความประณีตเป็นอย่างสูง แต่ในระยะหลังใช้การวาดลวดลายจิตรกรรมแล้วระบายสี ทำให้สะดุดตาและสะดวกกว่า\n" +
                "เรือกอและ เป็นเรือประมงที่ใช้ในแถบภาคใต้ตอนล่างของประเทศไทย ต่อด้วยไม้กระดาน โดยทำส่วนหัวและส่วนท้ายสูงขึ้นจากลำเรือ หรืออีกแบบจะเป็นแบบหัวสั้นและท้ายตัด นิยมทาสีพื้นตลอดลำเรือ แล้วเขียนลวดลายด้วยสีฉูดฉาด ซึ่งลวดลายอันวิจิตรนี้เองที่เป็นเอกลักษณ์ของเรือกอและ ที่ผสมผสานระหว่างศิลปะไทย อิสลาม จีน และศิลปะอื่น ๆ เนื่องจากอิทธิพลที่ได้รับมาจากสภาพแวดล้อมอันได้แก่ภูมิประเทศ ภูมิอากาศ สังคมความเป็นอยู่ ซึ่งสังคมความเป็นอยู่ในจังหวัดปัตตานีนั้น ประกอบไปด้วยชนชาติ 3 ชนชาติที่อาศัยอยู่ร่วมกันนั่นคือ ชาวไทยพุทธ ชาวไทยมุสลิมและชาวจีน จิตรกรรมที่ศิลปินไทยมุสลิมวาดตกแต่งเรือกอและมีข้อจำกัดในด้านหลักความเชื่อทางศาสนาอิสลาม จึงไม่มีภาพคนร้องรำทำเพลง หรือลักษณะที่ยั่วยุกามารมณ์ ภาพส่วนใหญ่เป็นภาพสัตว์น้ำ สัตว์ในจินตนาการจากประเพณี ศาสนา วรรณคดี ศิลปะการแสดงต่าง ๆ สัตว์หิมพานต์และภาพทิวทัศน์\n");


        initRecyclerView2();
    }
    private void initRecyclerView2(){
        LinearLayoutManager layoutManager = new LinearLayoutManager(this, LinearLayoutManager.HORIZONTAL, false);
        RecyclerView recyclerView = findViewById(R.id.recyclerView2);
        recyclerView.setLayoutManager(layoutManager);
        RecyclerViewAdapter adapter = new RecyclerViewAdapter(this,mNames2, mImageUrls2,mDes2);
        recyclerView.setAdapter(adapter);
    }

    private void getImages3(){
        mImageUrls3.add("");

        initRecyclerView3();
    }
    private void initRecyclerView3(){
        LinearLayoutManager layoutManager = new LinearLayoutManager(this, LinearLayoutManager.HORIZONTAL, false);
        RecyclerView recyclerView = findViewById(R.id.recyclerView3);
        recyclerView.setLayoutManager(layoutManager);
        RecyclerViewAdapter adapter = new RecyclerViewAdapter(this,mNames3, mImageUrls3,mDes3);
        recyclerView.setAdapter(adapter);
    }
}
